{
	"name": "Shards",
	"icon": "immersiveweapons:diamond_shard",
	"category": "immersiveweapons:resources",
	"pages": [
		{
			"type": "patchouli:text",
			"text": "Shards are a common material when sharpness is a priority. As such, you'll find them commonly in arrows, musket balls, and pikes.$(br2)Not all shards are used for their sharpness though. Some materials naturally break into shards, which is the case for items like Molten and Ventus ores."
		},
		{
			"type": "patchouli:spotlight",
			"item": "immersiveweapons:wood_shard",
			"link_recipe": true,
			"text": "Wooden shards can be obtained by breaking logs with a pickaxe. They're incredibly weak and are only useful for shoddy weaponry."
		},
		{
			"type": "patchouli:spotlight",
			"item": "immersiveweapons:stone_shard",
			"link_recipe": true,
			"text": "Stone shards can be obtained by placing cobblestone by itself in a crafting grid. Like wooden shards, these are only useful for low-quality items."
		},
		{
			"type": "patchouli:spotlight",
			"item": "immersiveweapons:diamond_shard",
			"link_recipe": true,
			"text": "Diamond shards can be obtained by placing a diamond by itself in a crafting grid. They are quite sharp and constitute high-end weapons."
		},
		{
			"type": "patchouli:spotlight",
			"item": "immersiveweapons:obsidian_shard",
			"link_recipe": true,
			"text": "Obsidian shards can be obtained by placing an obsidian block by itself in a crafting grid. They're only used as a component of Molten ingots."
		},
		{
			"type": "patchouli:spotlight",
			"item": "immersiveweapons:molten_shard",
			"link_recipe": true,
			"text": "Molten shards are obtained from Molten ore rarely in the Nether. They're only used as a component of Molten ingots."
		},
		{
			"type": "patchouli:spotlight",
			"item": "immersiveweapons:ventus_shard",
			"link_recipe": true,
			"text": "Ventus shards are obtained from Ventus ore, which is found rarely on Cloud Islands. All Ventus items require shards for crafting."
		}
	],
	"advancement": "immersiveweapons:shards"
}